<h1 style='color:white;font-size:25px;font-weight:700;margin-top:30px'>Pandas (отримання даних, створення періодних стовпців, групування за різними ознаками)</h1>

<h2 style = 'color:#white;font-size:20px'>1. Імпорт даних та читання <b><i>csv</i></b> файлу </h2>

In [18]:
import pandas as pd
df = pd.read_csv('C:/Users/den/Desktop/pandas/pandas-learn/data/Home_Sale_Data.csv')

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 799 entries, 0 to 798
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Address            799 non-null    object
 1   City               799 non-null    object
 2   CustomerID         799 non-null    int64
 3   CustomerFirstName  799 non-null    object
 4   CustomerLastName   799 non-null    object
 5   SquareFootage      799 non-null    object
 6   SquareMeters       799 non-null    int64
 7   Acreage            799 non-null    float64
 8   AskingPrice        799 non-null    float64
 9   SalePrice          799 non-null    float64
 10  SaleDate           799 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 68.8+ KB

<h2 style = 'color:#white;font-size:20px'>2. Отримання інформації про місяць в якому відбувся продаж</h2>

In [19]:
df['SaleDate'] = pd.to_datetime(df['SaleDate'])

df['Month'] = df['SaleDate'].dt.month

df[['Address','Month']]

                   Address  Month
0       48023 Pearl Street      2
1      73842 Hartford Road     10
2     72026 Franklin Court      2
3      12946 Cypress Court      2
4      12033 Warren Street      4
..                     ...    ...
794    92344 Redwood Drive     11
795  59377 Marshall Street     12
796     10030 Grant Avenue      6
797   78844 Cardinal Drive      1
798   98133 Carriage Drive      4

[799 rows x 2 columns]

<h2 style = 'color:#white;font-size:20px'>3. Групування за місяцем та отримання к-сті проданих в конкретний місяць</h2>

In [20]:
df_group_count_salePrice = df.groupby(by='Month')['SalePrice'].count()

df_group_count_salePrice

Month
1     62
2     77
3     85
4     68
5     58
6     59
7     64
8     67
9     68
10    69
11    65
12    57
Name: SalePrice, dtype: int64

<h2 style = 'color:#white;font-size:20px'>4. Групування за місяцем та отримання суми комісії яку було сплачено</h2>

In [21]:
df['Commision'] = df['SalePrice'] * 0.1

df_group_sum_commision = df.groupby(by='Month')['Commision'].sum()

df_group_sum_commision

Month
1     2422420.765
2     2929314.773
3     3305927.711
4     2852671.633
5     2897209.883
6     2226638.355
7     2888400.355
8     3429634.614
9     2294347.579
10    3194189.775
11    2959840.426
12    2807174.616
Name: Commision, dtype: float64

<h2 style = 'color:#white;font-size:20px'>5. Групування за місяцем та отримання середнього значення ціни продажу</h2>

In [22]:
df_group_mean_salePrice = df.groupby(by='Month')['SalePrice'].mean()

df_group_mean_salePrice

Month
1     390713.026613
2     380430.490000
3     388932.671882
4     419510.534265
5     499518.945345
6     377396.331356
7     451312.555469
8     511885.763284
9     337404.055735
10    462926.054348
11    455360.065538
12    492486.774737
Name: SalePrice, dtype: float64

<h2 style = 'color:#white;font-size:20px'>6. Групування за містом та отримання к-сті проданих в конкретний місяць</h2>

In [23]:
df_group_count_salePrice = df.groupby(by='City')['SalePrice'].count()

df_group_count_salePrice

City
Covington, KY         70
Erlanger, KY          43
Florence, KY          98
Frankfort, KY         35
Georgetown, KY        60
Jeffersontown, KY    103
Lexington, KY         93
Louieville, KY       169
Nicholasville, KY     22
Richmond, KY          40
St. Matthews, KY      66
Name: SalePrice, dtype: int64

<h2 style = 'color:#white;font-size:20px'>7. Групування за містом та отримання отримання середнього значення комісії</h2>

In [24]:
df_group_mean_commision = df.groupby(by='City')['Commision'].mean()

df_group_mean_commision

City
Covington, KY        40291.567043
Erlanger, KY         38016.848023
Florence, KY         47460.578837
Frankfort, KY        33565.283886
Georgetown, KY       45515.704767
Jeffersontown, KY    39837.740544
Lexington, KY        45930.217441
Louieville, KY       41422.633645
Nicholasville, KY    44857.585636
Richmond, KY         41719.407875
St. Matthews, KY     47953.130242
Name: Commision, dtype: float64